:PROPERTIES:
:header-args:lisp: :package CLOSER-COMMON-LISP-USER
:END:
#+title: MOP: again!
#+date: 2025-12-24
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: lisp
*** Representing Classes
在 =standard-class= 这个 Metaclass 类中, 有以下的 =slots=:

#+begin_src lisp :exports both
(mapcar #'slot-definition-name (class-slots (find-class 'standard-class)))
#+end_src

#+RESULTS:
| sb-pcl::%type | sb-pcl::source | sb-pcl::plist | sb-pcl::name | sb-pcl::class-eq-specializer | sb-pcl::direct-superclasses | sb-pcl::direct-subclasses | sb-pcl::direct-methods | sb-pcl::%documentation | sb-pcl::safe-p | sb-pcl::finalized-p | sb-pcl::%class-precedence-list | sb-pcl::cpl-available-p | sb-pcl::can-precede-list | sb-pcl::incompatible-superclass-list | sb-pcl::wrapper | sb-pcl::prototype | sb-pcl::direct-slots | sb-pcl::slots |

*** Class Precedence Lists
使用 =compute-class-precedence-list= 来得到一个类的所有的依赖列表.

#+begin_src lisp :results verbatim :exports both
(compute-class-precedence-list (find-class 'coca:ns-window))
#+end_src

#+RESULTS:
: (#<coca.appkit:ns-window NSWindow 20BF3C908>
:  #<coca.appkit::ns-responder NSResponder 20BF3D600>
:  #<coca.foundation:ns-object NSObject 20BEDDD58>
:  #<standard-class coca.objc:standard-objc-object>
:  #<standard-class coca.objc::objc-pointer>
:  #<standard-class common-lisp:standard-object>
:  #<sb-pcl::slot-class sb-pcl::slot-object> #<sb-pcl:system-class common-lisp:t>)

